comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_321.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 916.016ms, rate sampling interval: 3151ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.17s   197.08ms   2.54s    64.63%
    Req/Sec   262.83      4.26   268.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.17s 
 75.000%    2.33s 
 90.000%    2.42s 
 99.000%    2.54s 
 99.900%    2.60s 
 99.990%    2.61s 
 99.999%    2.61s 
100.000%    2.61s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1660.927     0.000000            1         1.00
    1897.471     0.100000          529         1.11
    1994.751     0.200000         1052         1.25
    2056.191     0.300000         1580         1.43
    2109.439     0.400000         2108         1.67
    2166.783     0.500000         2642         2.00
    2197.503     0.550000         2903         2.22
    2232.319     0.600000         3169         2.50
    2263.039     0.650000         3423         2.86
    2295.807     0.700000         3691         3.33
    2328.575     0.750000         3957         4.00
    2342.911     0.775000         4075         4.44
    2359.295     0.800000         4206         5.00
    2375.679     0.825000         4337         5.71
    2392.063     0.850000         4468         6.67
    2408.447     0.875000         4610         8.00
    2416.639     0.887500         4670         8.89
    2426.879     0.900000         4747        10.00
    2435.071     0.912500         4811        11.43
    2443.263     0.925000         4869        13.33
    2453.503     0.937500         4936        16.00
    2459.647     0.943750         4973        17.78
    2463.743     0.950000         4994        20.00
    2471.935     0.956250         5032        22.86
    2480.127     0.962500         5062        26.67
    2490.367     0.968750         5094        32.00
    2496.511     0.971875         5113        35.56
    2500.607     0.975000         5126        40.00
    2508.799     0.978125         5145        45.71
    2514.943     0.981250         5160        53.33
    2521.087     0.984375         5175        64.00
    2527.231     0.985938         5186        71.11
    2531.327     0.987500         5193        80.00
    2535.423     0.989062         5199        91.43
    2541.567     0.990625         5208       106.67
    2545.663     0.992188         5215       128.00
    2553.855     0.992969         5221       142.22
    2557.951     0.993750         5225       160.00
    2562.047     0.994531         5229       182.86
    2566.143     0.995313         5232       213.33
    2572.287     0.996094         5236       256.00
    2576.383     0.996484         5239       284.44
    2578.431     0.996875         5241       320.00
    2580.479     0.997266         5242       365.71
    2584.575     0.997656         5244       426.67
    2586.623     0.998047         5246       512.00
    2588.671     0.998242         5247       568.89
    2590.719     0.998437         5248       640.00
    2592.767     0.998633         5249       731.43
    2594.815     0.998828         5250       853.33
    2596.863     0.999023         5251      1024.00
    2598.911     0.999121         5253      1137.78
    2598.911     0.999219         5253      1280.00
    2598.911     0.999316         5253      1462.86
    2598.911     0.999414         5253      1706.67
    2603.007     0.999512         5254      2048.00
    2603.007     0.999561         5254      2275.56
    2603.007     0.999609         5254      2560.00
    2605.055     0.999658         5255      2925.71
    2605.055     0.999707         5255      3413.33
    2605.055     0.999756         5255      4096.00
    2605.055     0.999780         5255      4551.11
    2605.055     0.999805         5255      5120.00
    2609.151     0.999829         5256      5851.43
    2609.151     1.000000         5256          inf
#[Mean    =     2166.656, StdDeviation   =      197.080]
#[Max     =     2607.104, Total count    =         5256]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7907 requests in 30.00s, 1.62MB read
Requests/sec:    263.56
Transfer/sec:     55.34KB