comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_401.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1609.820ms, rate sampling interval: 5300ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.30s   164.48ms   2.63s    59.92%
    Req/Sec   262.67      1.25   264.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.30s 
 75.000%    2.44s 
 90.000%    2.51s 
 99.000%    2.63s 
 99.900%    2.80s 
 99.990%    2.81s 
 99.999%    2.82s 
100.000%    2.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1958.911     0.000000            1         1.00
    2072.575     0.100000          528         1.11
    2129.919     0.200000         1055         1.25
    2187.263     0.300000         1589         1.43
    2242.559     0.400000         2107         1.67
    2297.855     0.500000         2637         2.00
    2324.479     0.550000         2895         2.22
    2351.103     0.600000         3152         2.50
    2379.775     0.650000         3427         2.86
    2406.399     0.700000         3676         3.33
    2435.071     0.750000         3953         4.00
    2447.359     0.775000         4076         4.44
    2459.647     0.800000         4200         5.00
    2473.983     0.825000         4346         5.71
    2486.271     0.850000         4473         6.67
    2498.559     0.875000         4604         8.00
    2504.703     0.887500         4684         8.89
    2508.799     0.900000         4725        10.00
    2516.991     0.912500         4809        11.43
    2523.135     0.925000         4871        13.33
    2531.327     0.937500         4932        16.00
    2535.423     0.943750         4959        17.78
    2541.567     0.950000         5001        20.00
    2545.663     0.956250         5025        22.86
    2553.855     0.962500         5058        26.67
    2562.047     0.968750         5089        32.00
    2566.143     0.971875         5108        35.56
    2570.239     0.975000         5124        40.00
    2574.335     0.978125         5137        45.71
    2580.479     0.981250         5158        53.33
    2584.575     0.984375         5169        64.00
    2588.671     0.985938         5179        71.11
    2594.815     0.987500         5187        80.00
    2611.199     0.989062         5193        91.43
    2643.967     0.990625         5201       106.67
    2676.735     0.992188         5209       128.00
    2695.167     0.992969         5214       142.22
    2709.503     0.993750         5218       160.00
    2723.839     0.994531         5222       182.86
    2738.175     0.995313         5226       213.33
    2752.511     0.996094         5230       256.00
    2760.703     0.996484         5232       284.44
    2766.847     0.996875         5234       320.00
    2775.039     0.997266         5236       365.71
    2781.183     0.997656         5238       426.67
    2787.327     0.998047         5240       512.00
    2789.375     0.998242         5241       568.89
    2791.423     0.998437         5242       640.00
    2793.471     0.998633         5243       731.43
    2797.567     0.998828         5244       853.33
    2799.615     0.999023         5245      1024.00
    2803.711     0.999121         5246      1137.78
    2803.711     0.999219         5246      1280.00
    2807.807     0.999316         5247      1462.86
    2807.807     0.999414         5247      1706.67
    2809.855     0.999512         5248      2048.00
    2809.855     0.999561         5248      2275.56
    2809.855     0.999609         5248      2560.00
    2813.951     0.999658         5249      2925.71
    2813.951     0.999707         5249      3413.33
    2813.951     0.999756         5249      4096.00
    2813.951     0.999780         5249      4551.11
    2813.951     0.999805         5249      5120.00
    2818.047     0.999829         5250      5851.43
    2818.047     1.000000         5250          inf
#[Mean    =     2295.882, StdDeviation   =      164.483]
#[Max     =     2816.000, Total count    =         5250]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7757 requests in 30.00s, 1.59MB read
Requests/sec:    258.57
Transfer/sec:     54.29KB