comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_501.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1623.713ms, rate sampling interval: 4452ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.24s   155.54ms   2.53s    59.55%
    Req/Sec   263.25      1.48   265.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25s 
 75.000%    2.38s 
 90.000%    2.46s 
 99.000%    2.53s 
 99.900%    2.55s 
 99.990%    2.56s 
 99.999%    2.57s 
100.000%    2.57s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1901.567     0.000000            1         1.00
    2034.687     0.100000          539         1.11
    2086.911     0.200000         1058         1.25
    2140.159     0.300000         1582         1.43
    2195.455     0.400000         2119         1.67
    2246.655     0.500000         2639         2.00
    2273.279     0.550000         2918         2.22
    2297.855     0.600000         3165         2.50
    2324.479     0.650000         3436         2.86
    2351.103     0.700000         3708         3.33
    2375.679     0.750000         3956         4.00
    2390.015     0.775000         4098         4.44
    2402.303     0.800000         4226         5.00
    2414.591     0.825000         4352         5.71
    2428.927     0.850000         4499         6.67
    2441.215     0.875000         4619         8.00
    2449.407     0.887500         4692         8.89
    2455.551     0.900000         4751        10.00
    2463.743     0.912500         4823        11.43
    2471.935     0.925000         4891        13.33
    2480.127     0.937500         4949        16.00
    2484.223     0.943750         4978        17.78
    2490.367     0.950000         5015        20.00
    2496.511     0.956250         5056        22.86
    2500.607     0.962500         5084        26.67
    2506.751     0.968750         5115        32.00
    2508.799     0.971875         5127        35.56
    2512.895     0.975000         5149        40.00
    2516.991     0.978125         5164        45.71
    2521.087     0.981250         5180        53.33
    2525.183     0.984375         5197        64.00
    2527.231     0.985938         5206        71.11
    2529.279     0.987500         5213        80.00
    2531.327     0.989062         5220        91.43
    2533.375     0.990625         5229       106.67
    2535.423     0.992188         5233       128.00
    2537.471     0.992969         5240       142.22
    2539.519     0.993750         5246       160.00
    2539.519     0.994531         5246       182.86
    2541.567     0.995313         5250       213.33
    2543.615     0.996094         5254       256.00
    2545.663     0.996484         5257       284.44
    2545.663     0.996875         5257       320.00
    2547.711     0.997266         5260       365.71
    2549.759     0.997656         5264       426.67
    2549.759     0.998047         5264       512.00
    2549.759     0.998242         5264       568.89
    2551.807     0.998437         5267       640.00
    2551.807     0.998633         5267       731.43
    2551.807     0.998828         5267       853.33
    2553.855     0.999023         5268      1024.00
    2555.903     0.999121         5270      1137.78
    2555.903     0.999219         5270      1280.00
    2555.903     0.999316         5270      1462.86
    2555.903     0.999414         5270      1706.67
    2557.951     0.999512         5271      2048.00
    2557.951     0.999561         5271      2275.56
    2557.951     0.999609         5271      2560.00
    2562.047     0.999658         5272      2925.71
    2562.047     0.999707         5272      3413.33
    2562.047     0.999756         5272      4096.00
    2562.047     0.999780         5272      4551.11
    2562.047     0.999805         5272      5120.00
    2566.143     0.999829         5273      5851.43
    2566.143     1.000000         5273          inf
#[Mean    =     2244.958, StdDeviation   =      155.542]
#[Max     =     2564.096, Total count    =         5273]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7912 requests in 30.00s, 1.62MB read
Requests/sec:    263.72
Transfer/sec:     55.37KB